# ScaledExtrusionLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionData..::..ScaledExtrusionLength Property
IFCExtrusionData Class See Also
---
The length of the extrusion, scaled in the units of the export.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double ScaledExtrusionLength { get; set; }
```

Visual Basic
---
```text
Public Property ScaledExtrusionLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ScaledExtrusionLength {
	double get ();
	void set (double value);
}
```

# See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace